app/views/teams/_form.html.erb

SELECT "players".* FROM "players"
---
    <%=f.label :capitan_id %>
    <%=f.select :capitan, Player.all.collect{ |organizer| [ organizer.first_name + organizer.last_name ,organizer.id]},
                                                    {include_blank: true}, {required: true}%>