app/views/teams/index.html.erb

        <td><%=team.name%></td>
        <td><%=Player.find(team.capitan).first_name%></td>
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 126], ["LIMIT", 1]]