app/views/teams/show.html.erb

<div class="container-teams">
<% Teamplayer.all.collect do |player| %>
 <% if player.team_id ==  @team.id.to_s && player.i_team && player.i_player%>
  	<div class="card" style="background:url(<%= Player.find(player.player_id).avatar.url %>) bottom left no-repeat">
---
SELECT "teamplayers".* FROM "teamplayers"
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]