app/views/tournamentteams/_form.html.erb

SELECT "teams".* FROM "teams"
---
    <%= f.label :team_id%>
    <%= f.select :team_id, Team.all.collect {|x| [x.name, x.id]} %> </br>