app/views/tournamentteams/index.html.erb

      <tr>
        <td><%=Tournament.find(tournamentteam.tournament_id).name%></td>
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]