app/views/tournamentteams/new.html.erb

<%if params[:solicitar]%>
<h1>Con cual equipo deseas solicitar el ingreso a <%= Tournament.find(params[:tournament]).name %></h1>
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]