app/views/tournaments/show.html.erb

SELECT "tournamentteams".* FROM "tournamentteams"
---

<% Tournamentteam.all.collect do |team| %>

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 126], ["LIMIT", 1]]
---
        <%if Team.exists?(team.team_id) && Team.exists?(team.team_id)%>
        <td><%= Team.find(team.team_id).name %></td>
        <td><%= Player.find(Team.find(team.team_id).capitan).first_name%></td>