app/views/tournaments/stadistic.html.erb

<h1> Estadisticas del torneo  <%= Tournament.find(params[:tournament]).name %>
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    <% goleadores = {}%>
    <%Event.all.order(:goals).collect do |event|%>
      <% if Match.exists?(id:event.match_id)%>
      <% if Match.find(event.match_id).tournament_id == params[:tournament] %>
---
SELECT "events".* FROM "events" ORDER BY "events"."goals" ASC
SELECT "events".* FROM "events"
SELECT "matches".* FROM "matches" WHERE (tournament_id = '3')
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

        <tr>
        <td><%= Player.find(player).first_name%></td>
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]