app/views/results/_form.html.erb

  <div class="field">
    <%= f.label Team.find(params[:local]).name %>
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]