app/views/events/_form.html.erb

    <%= f.label :player_id%>
    <%= f.select :player_id, (Teamplayer.where('team_id = ?',params[:local]) +Teamplayer.where('team_id = ?',params[:visitor])).collect  {|player| [Player.find(player.player_id).first_name,player.player_id]}, {:include_blank => "Select One"} %> </br>
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 124], ["LIMIT", 1]]
SELECT "teamplayers".* FROM "teamplayers" WHERE (team_id = '22')