app/views/nominates/_form.html.erb

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "teamplayers".* FROM "teamplayers" WHERE (team_id = '7')
---
    <%= f.label :player %>
    <%= f.select :player_id,Teamplayer.where('team_id = ?',params[:team]).collect {|x| [Player.find(x.player_id).first_name,x.player_id]}, autfocus: true %>