app/views/matches/_form.html.erb

SELECT "teams".* FROM "teams"
---
    <%= f.label :local %>
    <%= f.select :local, Team.all.collect {|team| [team.name]} %>

SELECT "tournaments".* FROM "tournaments"
---
    <%= f.label :tournament_name %>
    <%= f.select :tournament_name , Tournament.all.collect {|tour| [tour.name]}%>