app/views/matches/_form.html.erb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "tournamentteams".* FROM "tournamentteams" WHERE (tournament_id = '9')
---
    <%= f.label :local %>
    <%= f.select :local , Tournamentteam.where('tournament_id = ?',params[:tournament]).collect {|team| [Team.find(team.team_id).name,team.team_id]}%>