app/views/matches/index.html.erb

<h1><%= Tournament.find(params[:tournament]).name %></h1>
        <% Match.distinct(:date).order(:date).collect do |fecha| %>
---
SELECT DISTINCT "matches".* FROM "matches" ORDER BY "matches"."date" ASC