app/views/matches/index.html.erb

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
<p id="notice"><%= notice %></p>
<h1 id='nombre'><%= Tournament.find(params[:tournament]).name %></h1>

SELECT  1 AS one FROM "matches" WHERE (tournament_id = '5') AND "matches"."date" = $1 LIMIT $2  [["date", 1], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE (tournament_id = '5' AND date = 1) ORDER BY "matches"."date" ASC
---
        <% [1,2,3,4,5,6].each do |fecha|%>
          <%if Match.where('tournament_id = ?',params[:tournament]).exists?(date:fecha)%>

SELECT  "results".* FROM "results" WHERE "results"."match_id" = $1 LIMIT $2  [["match_id", 3], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "results" WHERE "results"."match_id" = $1 LIMIT $2  [["match_id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
                <tr>
                  <%if Team.find(match.local).capitan == current_player.id.to_s && !Result.exists?(match_id:match.id)%>

SELECT "matches".* FROM "matches"
---

                <%if Result.exists?(match_id:match.id)%>