app/controllers/events_controller.rb

  def create
    @event = Event.new(player_id:event_params[:player_id],goals:event_params[:goals],yellow_cards:event_params[:yellow_cards],red_cards:event_params[:red_cards],match_id:event_params[:match_id])
    respond_to do |format|
      if !Event.exists?(player_id:event_params[:player_id],match_id:event_params[:match])
      @event.save
---
SELECT  1 AS one FROM "events" WHERE "events"."player_id" = $1 AND "events"."match_id" = $2 LIMIT $3  [["player_id", "41"], ["match_id", "3"], ["LIMIT", 1]]
INSERT INTO "events" ("player_id", "goals", "created_at", "updated_at", "yellow_cards", "red_cards", "match_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["player_id", "43"], ["goals", 0], ["created_at", 2017-05-28 16:53:49 UTC], ["updated_at", 2017-05-28 16:53:49 UTC], ["yellow_cards", 1], ["red_cards", 0], ["match_id", "3"]]