app/controllers/matches_controller.rb

  def index
    @matches = Match.all
---
SELECT "matches".* FROM "matches"