app/controllers/matches_controller.rb

SELECT  1 AS one FROM "matches" WHERE "matches"."local" = $1 AND "matches"."visitor" = $2 LIMIT $3  [["local", "9"], ["visitor", "7"], ["LIMIT", 1]]
INSERT INTO "matches" ("local", "visitor", "date", "tournament_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["local", "21"], ["visitor", "21"], ["date", 1], ["tournament_name", "Endor"], ["created_at", 2017-05-26 19:55:19 UTC], ["updated_at", 2017-05-26 19:55:19 UTC]]
SELECT  1 AS one FROM "matches" WHERE "matches"."visitor" = $1 AND "matches"."date" = $2 LIMIT $3  [["visitor", "9"], ["date", 1], ["LIMIT", 1]]
---
  def create
    @match = Match.new(match_params)
    if !Match.exists?(local:match_params[:local],visitor:match_params[:visitor])
      if @match.save
        redirect_to matches_path(tournament: match_params[:tournament_id]),notice:'Se creo correctamente el partido'
      else
        redirect_to matches_path(tournament: match_params[:tournament_id]),notice:'No se pudo crear correctamente el partido.'
      end
    elsif match_params[:local] == match_params[:visitor]
      redirect_to new_match_path(tournament: match_params[:tournament_id]), notice:'Los equipos deben ser diferentes.'
    elsif !Match.exists?(local:match_params[:local],date:match_params[:date]) || !Match.exists?(visitor:match_params[:visitor],date:match_params[:date])

DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 2]]
---
  def destroy
    @match.destroy

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_match
      @match = Match.find(params[:id])