app/controllers/nominates_controller.rb

  def create
    @nominate = Nominate.new(match_id:nominate_params[:match_id],player_id:nominate_params[:player_id],team_id:nominate_params[:team_id])

    respond_to do |format|

      if !Nominate.exists?(match_id:nominate_params[:match_id],player_id:nominate_params[:player_id],team_id:nominate_params[:team_id])
        @nominate.save
---
SELECT  1 AS one FROM "nominates" WHERE "nominates"."match_id" = $1 AND "nominates"."player_id" = $2 AND "nominates"."team_id" = $3 LIMIT $4  [["match_id", "2"], ["player_id", "43"], ["team_id", "7"], ["LIMIT", 1]]
INSERT INTO "nominates" ("team_id", "match_id", "player_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["team_id", "7"], ["match_id", "2"], ["player_id", "43"], ["created_at", 2017-05-28 15:28:46 UTC], ["updated_at", 2017-05-28 15:28:46 UTC]]

    def set_nominate
      @nominate = Nominate.find(params[:id])
---
SELECT  "nominates".* FROM "nominates" WHERE "nominates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]