app/controllers/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    @players = Player.all

INSERT INTO "players" ("first_name", "last_name", "mail", "position", "created_at", "updated_at", "password_digest", "is_organizer", "birthday") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
      @player = Player.new(player_params)

      respond_to do |format|
        if @player.save

UPDATE "players" SET "mail" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "players"."id" = $4  [["mail", "nijulio1@uc.cl"], ["password_digest", "$2a$10$pxuGeMNP45njl14ujtBowO76MGRrfymhFxUhGpNUFxbKB.Krdzr6."], ["updated_at", 2017-06-09 18:57:19 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @player.update(player_params)

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
---
    def set_player
      @player = Player.find(params[:id])