app/controllers/results_controller.rb

SELECT "results".* FROM "results"
---
  def index
    @results = Result.all

SELECT  1 AS one FROM "results" WHERE "results"."match_id" = $1 LIMIT $2  [["match_id", 3], ["LIMIT", 1]]
INSERT INTO "results" ("match_id", "local", "visitor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["match_id", 16], ["local", 0], ["visitor", 1], ["created_at", 2017-05-27 02:08:32 UTC], ["updated_at", 2017-05-27 02:08:32 UTC]]
---
  def create
    @result = Result.new(local:result_params[:local],visitor:result_params[:visitor],match_id:result_params[:match_id])

    respond_to do |format|
      if !Result.exists?(match_id:result_params[:match_id])
        @result.save

SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_result
      @result = Result.find(params[:id])