app/controllers/sessions_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."mail" = $1 LIMIT $2  [["mail", "nijulio@uc.cl"], ["LIMIT", 1]]
---
  def create
    player = Player.find_by(mail: params[:session][:mail])