app/controllers/teamplayers_controller.rb

SELECT "teamplayers".* FROM "teamplayers"
---
  def index
    @teamplayers = Teamplayer.all

SELECT  1 AS one FROM "teamplayers" WHERE "teamplayers"."player_id" = $1 AND "teamplayers"."team_id" = $2 LIMIT $3  [["player_id", "32"], ["team_id", "11"], ["LIMIT", 1]]
SELECT "players".* FROM "players"
INSERT INTO "teamplayers" ("player_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player_id", "103"], ["team_id", "16"], ["created_at", 2017-05-26 19:20:32 UTC], ["updated_at", 2017-05-26 19:20:32 UTC]]
---
  def create
    @teamplayer = Teamplayer.new(teamplayer_params)
    if !Teamplayer.exists?(player_id:teamplayer_params[:player_id],team_id:teamplayer_params[:team_id])
    respond_to do |format|
      if @teamplayer.save

DELETE FROM "teamplayers" WHERE "teamplayers"."id" = $1  [["id", 156]]
---
  def destroy
    team = @teamplayer.team_id
    @teamplayer.destroy

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 154], ["LIMIT", 1]]
SELECT  "teamplayers".* FROM "teamplayers" WHERE "teamplayers"."id" = $1 LIMIT $2  [["id", 156], ["LIMIT", 1]]
---
    def set_teamplayer
      @teamplayer = Teamplayer.find(params[:id])