app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.all

INSERT INTO "teams" ("name", "capitan", "logo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sd"], ["capitan", "154"], ["logo", "sd"], ["created_at", 2017-05-26 19:30:16 UTC], ["updated_at", 2017-05-26 19:30:16 UTC]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def set_team
      @team = Team.find(params[:id])