app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def create
    @tournament = Tournament.new(tournament_params.merge(number_date:(tournament_params[:number_team].to_i-1)))

    respond_to do |format|
      if @tournament.save
---
INSERT INTO "tournaments" ("name", "organizer", "place", "bases", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "qwe"], ["organizer", "#<Player:0x007fe790c87100>"], ["place", "qweqwe"], ["bases", "qwe"], ["created_at", 2017-05-26 21:48:48 UTC], ["updated_at", 2017-05-26 21:48:48 UTC]]

    def set_tournament
      @tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]