app/controllers/tournamentteams_controller.rb

  def index
    @tournamentteams = Tournamentteam.all
---
SELECT "tournamentteams".* FROM "tournamentteams"

  def create
    @tournamentteam = Tournamentteam.new(tournamentteam_params)

      if !Tournamentteam.exists?(tournament_id:tournamentteam_params[:tournament_id],team_id:tournamentteam_params[:team_id])
      respond_to do |format|
      if @tournamentteam.save
---
SELECT  1 AS one FROM "tournamentteams" WHERE "tournamentteams"."tournament_id" = $1 AND "tournamentteams"."team_id" = $2 LIMIT $3  [["tournament_id", "5"], ["team_id", "7"], ["LIMIT", 1]]
INSERT INTO "tournamentteams" ("tournament_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tournament_id", "7"], ["team_id", "17"], ["created_at", 2017-05-26 19:16:07 UTC], ["updated_at", 2017-05-26 19:16:07 UTC]]

  def update
    respond_to do |format|
      if @tournamentteam.update(tournamentteam_params)
---
UPDATE "tournamentteams" SET "team_id" = $1, "tournament_id" = $2, "updated_at" = $3 WHERE "tournamentteams"."id" = $4  [["team_id", "22"], ["tournament_id", ""], ["updated_at", 2017-05-26 20:14:32 UTC], ["id", 35]]

  def destroy
    @tournamentteam.destroy
---
DELETE FROM "tournamentteams" WHERE "tournamentteams"."id" = $1  [["id", 41]]

    def set_tournamentteam
      @tournamentteam = Tournamentteam.find(params[:id])
---
SELECT  "tournamentteams".* FROM "tournamentteams" WHERE "tournamentteams"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]