app/controllers/tournamentteams_controller.rb

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def create
    @tournamentteam = Tournamentteam.new(tournamentteam_params)

    respond_to do |format|
      if total_team >= Tournament.find(@tournamentteam.tournament_id).number_team