app/views/teamplayers/_form.html.erb

    <%= f.label :player_id%>
    <%= f.select :player_id, Player.all.collect {|x| [x.first_name, x.id]}, {:include_blank => "Select One"} %> </br>
---
SELECT "players".* FROM "players"